[
    {
        "title": "NASA's Perseverance Rover 100 Days Out",
        "preview": "Mark your calendars: The agency's latest rover has only about 8,640,000 seconds to go before it touches down on the Red Planet, becoming history's next Mars car."
    },
    {
        "title": "NASA's New Mars Rover Is Ready for Space Lasers",
        "preview": "Perseverance is one of a few Mars spacecraft carrying laser retroreflectors. The devices could provide new science and safer Mars landings in the future."
    },
    {
        "title": "From JPL's Mailroom to Mars and Beyond",
        "preview": "Bill Allen has thrived as the mechanical systems design lead for three Mars rover missions, but he got his start as a teenager sorting letters for the NASA center."
    },
    {
        "title": "NASA's InSight Flexes Its Arm While Its 'Mole' Hits Pause",
        "preview": "Now that the lander's robotic arm has helped the mole get underground, it will resume science activities that have been on hold."
    },
    {
        "title": "NASA Wins Two Emmy Awards for Interactive Mission Coverage",
        "preview": "NASA-JPL's coverage of the Mars InSight landing earns one of the two wins, making this the NASA center's second Emmy."
    },
    {
        "title": "Follow NASA's Perseverance Rover in Real Time on Its Way to Mars",
        "preview": "A crisply rendered web application can show you where the agency's Mars 2020 mission is right now as it makes its way to the Red Planet for a Feb. 18, 2021, landing."
    },
    {
        "title": "Mars 2020 Stands on Its Own Six Wheels",
        "preview": "In time-lapse video, taken at JPL, captures the first time NASA's Mars 2020 rover carries its full weight on its legs and wheels."
    },
    {
        "title": "NASA's Perseverance Mars Rover Gets Balanced",
        "preview": "The mission team performed a crucial weight-balancing test on the rover in preparation for this summer's history-making launch to the Red Planet."
    },
    {
        "title": "10.9 Million Names Now Aboard NASA's Perseverance Mars Rover",
        "preview": "As part of NASA's 'Send Your Name to Mars' campaign, they've been stenciled onto three microchips along with essays from NASA's 'Name the Rover' contest. Next stop: Mars."
    },
    {
        "title": "Deadline Closing for Names to Fly on NASA's Next Mars Rover",
        "preview": "You have until Sept. 30 to send your names to Mars aboard the Mars 2020 rover. "
    },
    {
        "title": "A Martian Roundtrip: NASA's Perseverance Rover Sample Tubes",
        "preview": "Marvels of engineering, the rover's sample tubes must be tough enough to safely bring Red Planet samples on the long journey back to Earth in immaculate condition. "
    },
    {
        "title": "NASA Mars Mission Connects With Bosnian and Herzegovinian Town",
        "preview": "A letter from NASA was presented to the mayor of Jezero, Bosnia-Herzegovina, honoring the connection between the town and Jezero Crater, the Mars 2020 rover landing site."
    },
    {
        "title": "NASA's Push to Save the Mars InSight Lander's Heat Probe",
        "preview": "The scoop on the end of the spacecraft's robotic arm will be used to 'pin' the mole against the wall of its hole."
    },
    {
        "title": "Mars Scientists Investigate Ancient Life in Australia",
        "preview": "Teams with NASA's Mars 2020 and ESA's ExoMars practiced hunting for fossilized microbial life in the Australian Outback in preparation for their Red Planet missions. "
    },
    {
        "title": "NASA Establishes Board to Initially Review Mars Sample Return Plans",
        "preview": "The board will assist with analysis of current plans and goals for one of the most difficult missions humanity has ever undertaken."
    }
]